{
  "blog": [
    {
      "title": "Project Pulse",
      "date": "November 18, 2017",
      "location": "University of Calgary",
      "imageName": "blog17.png",
      "imageAltText": "Project Pulse",
      "content": "RED was beyond elated to present at Zenith ‘17, a Project Pulse event. Our volunteers had the opportunity to educate and create awareness around drug education and related biological mechanisms. RED looks forward to collaborating with the Project Pulse team in the future."
    },
    {
      "title": "RED’s Holiday Food Drive",
      "date": "November 16, 2017",
      "location": "University of Calgary",
      "imageName": "blog16.png",
      "imageAltText": "RED’s Holiday Food Drive",
      "content": "RED placed first place in the poster contest for the SU Campus Food Drive 2017-2018! With all the food donations, our lovely volunteers helped build the successful RED Polar Express food sculpture. All proceeds went directly to the SU Campus Food Bank. Thank you to everyone who donated and contributed to a great cause, it will definitely be an event to remember."
    },
    {
      "title": "Engaging Vulnerable People Workshop",
      "date": "November 8, 2017",
      "location": "University of Calgary",
      "content": "Thank you to everyone who joined RED in conjunction with Bear Necessities & 3 Things for UCalgary. It was our pleasure hosting the Calgary Drop-In Centre in delivering the Engaging Vulnerable People workshop at the University of Calgary. We definitely had the opportunity to network, develop our resumes, and simply learn something new!"
    },
    {
      "title": "RED x PARAMEDICS COLLAB",
      "date": "October 2, 2017",
      "location": "University of Calgary",
      "imageName": "blog15.png",
      "imageAltText": "RED x PARAMEDICS COLLAB",
      "content": "RED x YYC PARAMEDICS. Name a better duo, we’ll wait. RED is thankful to the lovely paramedics who took time out of their busy schedule to help RED film such an interesting video! Be on the lookout as RED will be posting teasers and other exclusive footage in the future."
    },
    {
      "title": "Fall 2017 Meet & Greet",
      "date": "September 27, 2017",
      "location": "University of Calgary",
      "imageName": "blog14.png",
      "imageAltText": "Meet and greet",
      "content": "RED's Meet & Greet was a success! Thank you to everyone who came out! Keep a lookout on your email and RED's social media pages to stay current with all of RED's plans for this school year‼️ 💯#rededucate"
    },
    {
      "title": "Devon Funding",
      "date": "September 27, 2017",
      "location": "Devon",
      "imageName": "blog13.png",
      "imageAltText": "Devon and RED",
      "content": "RED WOULD LIKE TO GIVE A HUGE THANK YOU SHOUTOUT TO DEVON FOR ITS CONTRIBUTIONS OF $1500.00! <br /> Your generous financial support is greatly appreciated.  With your contribution, RED will be able to allot more resources for a greater number of presentations in the school year (RED has 50 tentative presentations booked already), purchase more materials for the in-class presentations, and create a sense of team pride within RED through the distribution of customized RED crewnecks.  The generous support of individuals and groups like you make it possible for our club  to implement our vision regarding substance awareness and is an encouraging reminder of why we undoubtedly enjoy giving back to our community."
    },
    {
      "title": "Blaze Fundraiser",
      "date": "June 1, 2017",
      "location": "Blaze Pizza",
      "imageName": "blog12.png",
      "imageAltText": "RED Team at Blaze Pizza",
      "content": "June 1st was definitely one for the books! Thank you to everyone who came out and made RED's fundraiser a success! A huge shoutout to our raffle sponsors and a big thank you to @blazepizza for hosting us! The final numbers will be rolling in shortly! Until then, be sure to check out the photos from the evening!"
    },
    {
      "title": "Year in Review",
      "date": "May 31, 2017",
      "location": "University of Calgary",
      "imageName": "blog11.jpg",
      "imageAltText": "RED Year in Review",
      "content": "RED had an amazing run from 2016 to 2017. You can review our year with us by viewing the PDF <a href=\"/assets/files/RED_YIR.pdf\" target=\"_blank\">here</a>."
    },
    {
      "title": "McKenzie Highlands School!",
      "date": "May 17, 2017",
      "location": "McKenzie Highlands School",
      "imageName": "blog10.png",
      "imageAltText": "RED Team presenting at McKenzie Highlands School",
      "content": "RED has hit another home-run with two presentation days back-to-back at the McKenzie Highlands School! With exposure to a variety of neuroscience related topics, RED has definitely knocked these presentations out of the ballpark! We would once again like to thank our hard working volunteers who have taken time out from their well-deserved summer break and have contributed towards such a great educational experience! Hope you all have a relaxing summer and be sure to look forward to more presentations and events RED has planned in the near future!"
    },
    {
      "title": "That is a wrap!",
      "date": "April 18, 2017",
      "location": "Georges P. Vanier School",
      "imageName": "blog9.png",
      "imageAltText": "Mug from Georges P. Vanier School",
      "content": "That is a wrap!! First and foremost, RED would like to thank all of our presenters for their hard work and Georges P. Vanier School for letting us be a part of such a great, educational experience! Thanks to G.P. Vanier's generosity, four of our volunteers each received a mug. We love the gifts and are definitely looking forward to collaborating in the future."
    },
    {
      "title": "SU Club Awards",
      "date": "April 5, 2017",
      "location": "University of Calgary",
      "imageName": "blog8.jpg",
      "imageAltText": "SU Club awarding RED with Honorable Mention Community Service Award",
      "content": "On Wednesday April 5, RED had the pleasure of attending UofC's annual SU Club Awards Banquet and proudly brought home an Honourable Mention for Community Service award! We hope we can carry the momentum from last year onwards to the next year."
    },
    {
      "title": "LINKages x RED Collaboration",
      "date": "March 19, 2017",
      "location": "Murdoch Manor",
      "imageName": "blog7.png",
      "imageAltText": "RED team with participants from Murdoch Manor",
      "content": "RED can add another presentation to it is done list! RED recently collaborated with LINKages this past weekend and had the opportunity to lead interactive activities aimed at informing seniors about several common drugs and their effects on one’s brain and behavior. Topics such as substance misuse and addiction were explored through interactions among participants and throughout the event. To start off the event, LINKages participants were first asked series of trivia questions regarding biological pathways and the role of neurons. In the latter half, participants learned about familiar drugs and found themselves engaged in an insightful discussion surrounding the legalization of marijuana to conclude the day! All in all, RED received a lot of positive feedback from the participants and hopes to collaborate with LINKages in the near future! A huge shout out to our hardworking RED club volunteers- we cannot thank you enough!"
    },
    {
      "title": "More Presentations: Georges P. Vanier!",
      "date": "February 23, 2017",
      "location": "Georges P. Vanier",
      "imageName": "blog6.png",
      "imageAltText": "RED Team group photo at Georges P. Vanier",
      "content": "On February 23rd, RED had the privilege to deliver nine presentations to junior high school students in grades 7-9, attending Georges P. Vanier. It would not have been possible without our lovely RED club volunteers and we would like to thank each one of you for your continuous dedication and commitment! In terms of the in-class presentations, we were glad to hear about the heightened interest and engagement involving the activities planned and information conveyed by RED. Students were exposed to a variety of material from covering the role of the neurons in the brain to how different substances, such as alcohol, affect an individual’s behavior. Students also got the opportunity to take part in reaction time tests, engage in a debate surrounding a popular topic, and enjoyed diagnosing “patients” in our “Patient Overdose Investigation” activity. Overall, the presentations were an incredible experience and we look forward to the presentations planned in the near future!!"
    },
    {
      "title": "First Presentation: R.T. Alderman Middle School ",
      "date": "November 28, 2016",
      "location": "R.T. Alderman Middle School",
      "imageName": "blog5.png",
      "imageAltText": "RED volunteer with engaged students",
      "content": "Our first set of presentations was a success. Several members of the club were able to prepare and present a total of five presentations to grade 8 and 9 classes at RT Alderman Middle school. The feedback we received was all positive and we are looking forward to going back next year with updated presentations. RED is constantly working on research and development to keep our presentations up to date and relevant."
    },
    {
      "title": "Adults Only Night",
      "date": "November 10, 2016",
      "location": "Telus Spark",
      "imageName": "blog4.png",
      "imageAltText": "RED team engaging the public with interactive activities",
      "content": "Thanks to the Neuroscience Student Association (NSA) for wanting to collaborate with us for the \"Adults Only Night\" at Telus Spark on November 10th! Although RED is mainly focused on educating the you, we were able to expand our horizon and try to implement our activities with a bit of an older audience. With the support of the NSA, we hosted a fantastic event which participants seemed to really enjoy. Many learned new things, some tried to diagnose patients while others were too busy being competitive in our reaction-time test. All in all, it was a lot of fun informing the general public about the science of drugs! Stay tuned for more updates!"
    },
    {
      "title": "Bake Sale",
      "date": "October 26, 2016",
      "location": "University of Calgary",
      "imageName": "blog3.png",
      "imageAltText": "Baked goods for sale!",
      "content": "We had an amazing bake sale in which we raised roughly $200 that would be used to purchase materials for our presentations at our schools. Some of the money was also used to subsidize the cost of our new crewnecks for our members that are presenting. We want to personally thank anyone that contributed to the bake sale - especially Megan, with her awesome macarons!"
    },
    {
      "title": "Fall 2016 Meet & Greet",
      "date": "September 28, 2016",
      "location": "University of Calgary",
      "imageName": "blog2.png",
      "imageAltText": "Students mingling and eating free pizza!",
      "content": "On behalf of the executive team at RED, we want to thank everyone who attended the Meet and Greet on the 28th. We had a blast networking and meeting our new members, while enjoying some pizza! This year we have the opportunity to present at RT Alderman Junior high. We hope that with our hard work over the summer, we can deliver an amazing presentation in the coming weeks."
    }
  ]
}
